app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = 1
---
  def show
    @product = Product.find(params[:id])
    @reviews = Review.where(:product_id => params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO "products" ("created_at", "name", "price", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 12 Apr 2013 02:35:46 UTC +00:00], ["name", "MacBook Air"], ["price", 1300.0], ["updated_at", Fri, 12 Apr 2013 02:35:46 UTC +00:00]]
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "products" SET "name" = 'MacBook Pro', "description" = 'MacBook Pro features a precision unibody enclosure crafted from a single block of aluminum.', "image_url" = 'http://ecx.images-amazon.com/images/I/41t0EjbJXYL._AA160_.jpg', "in_cart" = 'f', "updated_at" = '2013-04-12 04:06:29.252177' WHERE "products"."id" = 1
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])