app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews"
---
  def index
    @reviews = Review.all

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @review = Review.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "products".* FROM "products"
---
  def new
    @review = Review.new
    @passed_product = Product.find(params[:id]) if params[:id]
    @products = Product.all

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "5"]]
---
  def edit
    @review = Review.find(params[:id])

INSERT INTO "reviews" ("body", "created_at", "product_id", "rating", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @review = Review.new(params[:review])

    respond_to do |format|
      if @review.save

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "reviews" SET "product_id" = 5, "updated_at" = '2013-04-11 16:51:39.070496' WHERE "reviews"."id" = 5
---
  def update
    @review = Review.find(params[:id])

    respond_to do |format|
      if @review.update_attributes(params[:review])

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 5]]
---
  def destroy
    @review = Review.find(params[:id])
    @review.destroy